CSI API ETABS v1

# cSelect Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cSelect

    Public Interface cSelect

    Dim instance As cSelect

    public interface class cSelect

    type cSelect =  interface end

The cSelect type exposes the following members.

Methods

| Name| Description
---|---|---
|
All|  Selects or deselects all
objects in the model.
|
ClearSelection|  Deselects all
objects in the model.
|
GetSelected|  Retrieves a list of
selected objects
|
Group|  Selects or deselects all
objects in the specified group.
|
InvertSelection|  Deselects all
selected objects and selects all unselected objects; that is, it inverts the
selection
|
PreviousSelection|  Restores the
previous selection
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com